---
kind: type
id: T:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralLA
source: html/ac8289f3-7267-03b2-450a-df1a50ccc844.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralLA

Defines parameters for Angle Cold Formed structural section.

## Syntax (C#)
```csharp
public class StructuralSectionGeneralLA : StructuralSectionColdFormed
```